Revit 2026 API

# RevisionsOnSheetUIServiceDataGetRevitElementIds Method

---

return the list of revit Element Ids

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<ElementId> GetRevitElementIds()
```
```vb
Public Function GetRevitElementIds As IList(Of ElementId)
```
```cpp
public:
IList<ElementId^>^ GetRevitElementIds()
```
```fsharp
member GetRevitElementIds : unit -> IList<ElementId>
```

#### Return Value

IListElementId

#### Reference

RevisionsOnSheetUIServiceData Class

Autodesk.Revit.UI Namespace